[
    "На вопрос: \"Можно ли это сделать?\" — Отвечаю да. А потом думаю как.",
    "Стер комментарии, поменял форматирование. Как будто бы сам написал.",
    "Что объединяет программиста и наркомана? Красные глаза.",
    "Никого работа программы не удивляет так часто, как ее создателя.",
    "Увидел свой код полугодовой давности. Чуть не помер со стыда.",
    "Сломался ноут перед отъездом. Дорога в никуда.",
    "Все мы ходим по лезвию бритвы. Кто-то нюхает кокаин, кто-то убивает людей. Я же, не обнуляю переменные.",
    "Перепутал Рождество с Хэллоуином. oct(31) = dec(25).",
    "Только ненаписанный код не содержит ошибок.",
    "Убраться на столе? Не, не слышал.",
    "First words in my life? \"Hello, world!\"",
    "Приснился кошмар. Microsoft Linux XP.",
    "Этот волнительный момент, когда код написан правильно, но ничего не работает!",
    "Чак Норрис не получает ошибки компилятора. Компилятор сам подстраивается под Чака.",
    "Не ошибается тот, кто ничего не кодит.",
    "Дорогой, сходи, купи пакет молока и если будут яйца, купи 6. Купил 6 пакетов молока, яйца были.",
    "Удалил корзину в корзину.",
    "Запилил мега-функцию. Оказалось, велосипед.",
    "Код работает с первого раза? Ищите ошибку в компиляторе.",
    "Нельзя так просто взять и уйти с работы в 6.",
    "Кому и командная строка дружественный интерфейс...",
    "Когда мне хочется экстрима, делю на калькуляторе на ноль.",
    "Работай! Ну пожалуйста...",
    "Написал строчку, запустил, не работает. Стер. Написал то же самое.",
    "Идти спать?! — Да ну, лучше еще покодить... И так постоянно.",
    "На математике решали номер 1024. Друзья не поняли, почему он юбилейный.",
    "Люблю петь в душе. На ассемблере.",
    "Программист, ты стал совсем взрослым. У тебя уже растут руки.",
    "Хотите разозлить программиста? Попросите у него, чтобы он научил вас делать игры.",
    "Добавил несколько комментов. Лучше перекомпилю...",
    "Те-ле-ви-зор?.. Не, не слышал.",
    "Написал прогу — не работает. Написал систему под эту прогу — все отлично.",
    "Написал \"Hello, world\". Напишу и Windows 9.",
    "Что может быть красивее заката? \"Successful build\" на экране монитора.",
    "Как папку не назови, искать всё равно придется.",
    "Изучаешь ассемблер? Ты пал так низко!",
    "Неделю назад закодировался. Вчера подобрал код.",
    "Судя по отступам, Маяковский писал на Python.",
    "Решаем проблемы неизвестные никому способами, которые никто не знает.",
    "Глянул чужой код... Да лучше я напишу свой с нуля!",
    "Почему ты не пишешь код прямо сейчас?!",
    "У меня пальцы пианиста. И мозг математика.",
    "Кто рано встает, у того скоро дедлайн проекта.",
    "Семь бед — один reset.",
    "Вся жизнь — программа. А люди в ней локальные переменные.",
    "Солнце село, свет погас. Время кодинга сейчас!",
    "Первое правило программиста: не дай понять компьютеру, что ты торопишься.",
    "Завел кошку, еще не придумал, как назвать. Пока обращаюсь к ней по айпишнику.",
    "Конечно, дорогая, ты для меня дороже компьютера.",
    "Поставил убунту. Теперь говорю всем, что не разбираюсь в винде.",
    "Программист мудреет, когда понимает разницу между \"запустить программу\" и \"получить запускающуюся программу\".",
    "Нужно создать видимость работы. Форматирую код вручную.",
    "Не нашел ошибку в своем коде за час. Ошибка компилятора!",
    "Слушаю музыку с кейгенов.",
    "Чудеса случаются. Это я вам как программист говорю.",
    "А еще, чтобы от нас отстали, мы говорим обычно так: наши инженеры работают над решением вашей проблемы.",
    "Скомпилировал свою программу, появился Яндекс Бар.",
    "137 сообщений об ошибках. Забыл точку с запятой.",
    "Зашел на сайт. Нажал Ctrl+U.",
    "Сломался пробел? Не беда. Alt+32.",
    "Если мужчина согласился переустановить вам Windows, значит, вы ему действительно нравитесь.",
    "Я не помню, почему написал это таким кривым образом, но на это точно была причина.",
    "В магазине попросили передать пакет. Спросил IP адрес.",
    "Программист говоришь? Контакт взломать сможешь?",
    "Идеального кода не существует, так как нет предела совершенству!",
    "Пришел в гости — почини компьютер.",
    "Проснулся. Оказалось, не спал.",
    "Настроил комп против людей!",
    "Я залогинился взглянуть, не залогинилась ль она, чтоб посмотреть, не залогинился ли я.",
    "Ты думал это любовь. А ей просто надо было винду переустановить.",
    "Запели птички. Пора ложиться спать.",
    "Пишешь код во сне? Значит скоро сдача проекта!",
    "Бывших программистов не существует.",
    "Когда я устраивался на работу, мне сказали, чтобы я забыл всё, чему учился в универе. Ну я и забыл.",
    "Второе правило программиста: троллить простых смертных, которые задают глупые вопросы.",
    "Причина багов — преждевременная компиляция.",
    "\"Это не наш метод,\" — сказал один класс другому.",
    "В моих программах нет багов. Есть лишь неожиданные фичи.",
    "Пока засыпал, полностью обдумал код. Проснулся – забыл.",
    "Удобный интерфейс? Главное, что работает.",
    "Хуже всего приходится программистам Microsoft. Им, в случае чего, и обругать-то некого.",
    "У всех свои тараканы в голове, но у разработчиков они превращаются в программные баги.",
    "Сынок, хватит сидеть за компьютером. Я программирую, мам!",
    "Ничто так не ограничивает полет мысли, как компилятор.",
    "Друг рассказал, что микроволновка сломалась. Спросил, что пишет в логах.",
    "К Н Ш М Ы. Доктор, у вас неправильная кодировка.",
    "Дописал свою баговую прогу, все продебажил, работает идеально...но тут — проснулся.",
    "Я не лентяй! Я — программист.",
    "Чтобы компенсировать растущую мощность компьютеров, программисты используют фреймворки.",
    "Познакомился с девушкой. Попросил IP.",
    "Админу стало скучно. Позвонил в тех. поддержку, сказал, что сломался интернет.",
    "Программист — это профессиональный конвертёр галлюцинаций заказчика в жёсткую формальную систему.",
    "Я не хочу ничего решать! Я хочу ТЗ.",
    "Сколько раз себе говорил: \"пришел домой — сначала покушай и только потом за комп\".",
    "Программист — самый трудолюбивый работник в фирме! До обеда и пашню засеял, и город построил, и воинов нанял!",
    "Минздрав предупреждает: программирование является причиной развития интеллекта и креативности мышления.",
    "Интересно, что бы Шерлок Холмс мог сказать о моем коде?",
    "На чем пишешь — звучит так же, как: где служил?",
    "От меня боятся принимать .exe файлы.",
    "Написал 2000 строк кода без ошибок с первого раза. Проснулся.",
    "Не обдумывай код. Будь спонтанным.",
    "Мои дети постоянно ссорятся. Конфликт версий.",
    "Первое правило уборки в квартире: убрать себя от компьютера.",
    "Переустановил соседу винду. Теперь скрываюсь от других соседей.",
    "Я работаю, когда отдыхаю. И отдыхаю, когда работаю.",
    "Есть две вещи, которым программист учится всю жизнь. Читать и писать.",
    "Заработался. Перепутал 3 этаж с 11.",
    "Открываю IDE с исходным кодом, чтобы другие люди боялись трогать компьютер.",
    "Завожу переменную \"С\". Чтобы в коде писать С++.",
    "Сяду в умную позу и нахмурю брови. Босс решит, что я думаю над проблемой.",
    "Сделал неправильно. Скажу, что так и задумано.",
    "Сломался комп. Ем на кухне.",
    "Думать или загуглить — вот в чем вопрос.",
    "Из-за леса, из-за гор, к нам пришел Fatal Error.",
    "Мне кажется, начальник на меня смотрит и думает: \"Это устройство может работать быстрее\".",
    "Не поставил запятую — положил сервак.",
    "Этот момент, когда на форуме написал название функции наполовину и ждёшь, когда IDE допишет её.",
    "Отпуск — время переустановить ОС.",
    "Израильский SQL-сервер. Отвечает запросом на запрос.",
    "Ну вот допустим, у тебя есть $1000. Давай для определенности округлим до $1024...",
    "Готовлю еду по алгоритму.",
    "Все работает. Оптимизировал. Не работает.",
    "Не воспринимаю всерьёз людей, моложе Windows 98.",
    "Хороший программист характеризуется умением доказать, почему задачу невозможно выполнить, когда ему просто лень её выполнять.",
    "\"Плохая\" переменная отдаётся всем функциям подряд и разрешает делать с собой всё, что угодно.",
    "Сколько программистов нужно, чтобы закрутить лампочку? Ни одного. Это аппаратная проблема. ",
    "Звоню в поддержку провайдера — послушать музыку.",
    "Что такое индустриальное программирование? Сидят индусы и пишут триальные программы!",
    "У всех компиляторы как компиляторы, а мой — истеричка.",
    "Вы что, читать не умеете?! Тут же #000000 по #FFFFFF написано.",
    "Нечем заняться... Переустановлю ОС!",
    "Мышечная память — это когда страница еще не загрузилась, а ты уже поставил мышку на то место, куда надо кликнуть.",
    "Жизнь — игра. Сюжет — так себе, но графика потрясающая.",
    "9 утра. — Уже работаешь? ... — Ещё работаю.",
    "Нормализовал базу, правильно применил паттерны, придумал быстрый алгоритм, оптимизировал его код... Эх, мечты, мечты.",
    "Начал решать проблему с помощью регулярных выражений. Теперь решаю две проблемы.",
    "Если хочешь что-то сделать, сделай это сам.",
    "Нашим детям будет сложно. Все логины будут заняты.",
    "Написал вирус, чтобы протестировать антивирус.",
    "Хакер — человек способный наступить на грабли, даже если они спрятаны в сарай и заперты на замок. ",
    "Меня трудно найти, легко потерять и невозможно забыть. Да я же рабочий исходник!",
    "Когда получаю новый проект, думаю не о процессе написания, а о сладком моменте финала!",
    "Скинь свой исходник. Мне просто сравнить...",
    "Дебажил 6 часов. Понял, что баг в компиляторе.",
    "Перед тем как программировать полгода подбирал язык программирования.",
    "Вы пробовали выключить и снова включить?",
    "Исправил в коде одну ошибку. Создал две новых.",
    "Программирование — это игра слов.",
    "Не компилируй мне мозги!",
    "На ассемблере можно написать всё что угодно. Но жизнь коротка.",
    "Попросили написать программу на Basic. Написал и скинул на перфокарту.",
    "Два часа искал ошибку в коде и вдруг! случайно нашёл её! Что? И всё из-за этой хрени?",
    "Пришел в гости. Научил кота выключать комп.",
    "Если нацарапать гвоздиком что-нибудь на дискете, то прочесть с нее можно только то, что вы на ней нацарапали.",
    "В аду есть отдельный котёл для тех, кто называет системный блок процессором.",
    "Переустановка Windows — как разморозка холодильника. Помогает, но ненадолго.",
    "Уволился с работы. Наконец-то можно покодить от души.",
    "Тоскую по тем временам, когда к ЭВМ допускали людей только с прямыми руками.",
    "Сказали, что завтра проверка лицензии на компах. Поставил Ubuntu.",
    "#define private public. Показать все, что скрыто.",
    "Два телепата начали читать мысли друг друга одновременно... Умерли от переполнения стека.",
    "— Папа, а кто-то ещё пишет на Паскале? — Нет, сын, это — фантастика.",
    "Почистил дорожку от снега. Повысил пропускную способность.",
    "Sudo. Почувствуй себя всемогущим.",
    "Я твоя программа и я не хочу создавать файл, я хочу права администратора.",
    "9:00 — пришел на работу. 13:40 — запустил IDE.",
    "Звоню в поддержку. Говорю, что делать.",
    "Разгруппировал файлы в папке \"мусор\" по типу файлов. Стало почище.",
    "Увидел синий экран в телевизоре. По привычке перезапустил.",
    "— А зачем ты сохраняешься в ворде перед печатью? — Привычка.",
    "Захотел поиграть в тетрис. Написал его.",
    "Видели ночь, кодили всю ночь до утра!",
    "Я просто хотел написать игру. И тут понеслась.",
    "Самое большое заблуждение: \"Встану-ка я завтра пораньше и всё доделаю\".",
    "Салат Фибоначчи. Составлен из вчерашнего и позавчерашнего салатов.",
    "Компилятор — не прощает ошибки.",
    "Работает? Не ожидал.",
    "Сын спросил: почему солнце восходит и заходит? Главное, что работает.",
    "Переустановил ей Windows. Даже спасибо не дала.",
    "Это странное чувство... Когда тебе не хочется кодить и тебя тянет на улицу.",
    "Бойся 228, если это число ошибок в коде.",
    "— Сейчас, у меня друг программист. — Алло, Саш? Тут у моей подруги фен сломался...",
    "Программист вообще в курсе, что он математик?",
    "99% ошибок компьютера сидят в полуметре от монитора.",
    "Нельзя просто так взять и скомпилировать чужие исходники с первого раза.",
    "Не все потеряно пока пальцы над клавой и на экране строка...",
    "Решил убраться на рабочем столе, создал папку и сгреб все туда.",
    "Самая большая ложь 21 века: я прочел и принимаю условия пользовательского соглашения.",
    "Если двух программистов посадить за один компьютер, будет много шума.",
    "Чужой код. 2500 строк. Нет комментариев. Непонятные переменные и функции. Ошибки с памятью... Вызов принят!",
    "Попросили исправить чужой код. сtrl+A; delete; пишу программу.",
    "Программист — это не тот, кто пишет программы, а тот, чьи программы работают.",
    "Программисты на работе общаются двумя фразами: \"непонятно\" и \"вроде работает\".",
    "У меня есть girlfriend. Сам написал на С++.",
    "Не пью, не курю, на ноль не делю.",
    "Не нашёл нужной программы в интернете. Написал сам.",
    "Люди делятся на два типа – первый – те, кто нумерует массивы с единицы и первый – те, кто нумеруют с нуля.",
    "Я знаю 9 операционных систем. И ни одной женщины.",
    "People always ask me why my keyboard is so loud. Don't they know that C++ is strongly typed.",
    "Каждый программист в своей жизни обязан написать калькулятор.",
    "Я не хочу печенек и кофе! Я хочу работать.",
    "Надоел вид за окном. Поменяю обои на рабочем столе.",
    "Настоящие программисты не боятся использовать goto.",
    "Собрал ядро Линукс. Руки переползли на плечи.",
    "Попросили установить \"какой-нибудь антивирус\". Поставил Linux!",
    "Пошел в туалет с ноутом. Вышел через три часа.",
    "Расписываю ручку: \"Hello, world\".",
    "Челябинские программисты настолько суровы, что кодят на печатной машинке.",
    "Лень решать задачу по математике. Написал программу, которая ее решает.",
    "Написал код. Пересмотрел его еще раз, чтобы понять, насколько я охуенен.",
    "Дети – это наше будущее! И роботы. Дети и роботы.",
    "Программирование как секс. Ошибешься — и нужно поддерживать всю жизнь.",
    "Пришел к девушке с цветами и шампанским — отказала. Стандартные драйверы не подошли.",
    "Нет повести печальнее на свете, чем повесть об упавшем интернете.",
    "Красивый загар, где отдыхал? Отдыхал? Это от монитора.",
    "Проспал дедлайн. Зато выспался.",
    "Не откладывай на завтра, если завтра сдача проекта. Хотя...",
    "Любимые хэш-тэги программистов: #include и #define.",
    "Пытаешься понять, почему код не работает. На следующий день запускаешь — работает. Как?!",
    "Мы писали, мы писали, наши пальчики устали. Мы немного отдохнем и опять писать начнем!",
    "А вы знали, что блок схемы нужны, чтобы писать по ним код, а не наоборот?!",
    "Решил походить по собеседованиям. Понял, насколько мало я знаю.",
    "Что ещё может будоражить кровь так, как кодинг до четырёх утра.",
    "Написал интуитивно код. Запустил. Работает. Теперь сижу, разбираюсь, как именно работает.",
    "Чтобы разобраться в чужом коде, нужен тот, кто его писал и паяльник.",
    "Первыми словами моего сына будет: \"Hello, world!\"",
    "Идеальный интерфейс — это когда мама понимает.",
    "Кто-то ищет вторую половинку. Я ищу ошибку в коде.",
    "Клавиша \"с\". Будь проклят тот, кто додумался до этого...",
    "Кроме женщин и компьютеров, я люблю девушек и калькуляторы.",
    "Не нашел диск с драйверами — написал сам.",
    "Телевизор?.. А он ещё существует???",
    "Долгое время считалось, что бит неделим. Но советские ученые...",
    "Я категоричен, как Boolean.",
    "Программирование — процесс творческий. А вдохновение приходит поздно вечером.",
    "Выучил английский очень быстро. Он очень похож на С++.",
    "Давайте утром встретимся... В 14.00 вас устроит?",
    "Исправлял один баг. Создал другой.",
    "Зевнул перед зеркалом. Вызвал рекурсию.",
    "Чем программист отличается от Бога: Бог не считает себя программистом.",
    "Перенес рабочую функцию в новый проект. Не работает.",
    "Поступил на программиста. 2 года думал, что учусь на профессора математики.",
    "В Гарри Поттере в газетах печатают гифки.",
    "Тех. поддержка. Семь бед — один ответ.",
    "Защищаю курсовую. Старательно обхожу баги.",
    "No Windows. No problems.",
    "Кто сдал проект, тот в цирке не смеётся.",
    "Свой код — потёмки. Чужой — лес непроходимый.",
    "Кодим! До потери сознания!",
    "Один терапевт — это 1024 гигапевта, или 1048576 мегапевтов.",
    "Скоро останется два типа людей. Те, кто управляет компьютерами, и те кем управляют компьютеры.",
    "Решил поработать. Но вдруг Хабрахабр сам открылся.",
    "Задал вопрос на российском форуме. Объяснили, какой я идиот.",
    "У меня нет решения. Но я восхищен красотой проблемы.",
    "Вероятность успешной компиляции с первого раза крайне мала.",
    "Купил айфон и кило яблок. Пытаюсь их также откусить.",
    "Неправильно указал тип переменной. 2 + 2 = 22",
    "Люди делятся на два типа \"shift+alt\" и \"ctrl+shift\".",
    "Программисты не рождаются. Программисты наследуются.",
    "Я сам раозбарл, поичтсил и сбоарл клаиуавтру.",
    "Ну что непонятного? Я же русским языком сказал: баг пофиксил, проапдейтил продакшен.",
    "Чайник показал код и спросил, где у него ошибка. Ответил, что в ДНК.",
    "Посеял ключи от квартиры. В голове крутятся мысли о Ctrl+F.",
    "Медленный компьютер — это когда ты знаешь имена всех разработчиков Adobe Pfotoshop.",
    "А+=++А+++++А++; Java-программисты смеются над вами.",
    "Подруга написала: \"Привет)\". Ответил, что она забыла одну скобку.",
    "И я там был, wi-fi ловил. Сети находило, а доступа не давало.",
    "Закончил проект! Заказчик сменил ТЗ...",
    "При компиляции держу пальцы крестиком.",
    "В аду уже уготовано место для тех, кто путает программистов с сисадминами.",
    "Ничто так не возбуждает дам, как разработка компьютерных программ.",
    "Ночью спать? Не, не пробовал...",
    "Девушка сказала 100000 раз написать \"Прости\". for i:=1 to 100000 do writeln('Прости').",
    "Знакомые гуманитарии узнали, что я программист. Достали шутками про 0 и 1.",
    "Задачу поставили другому программисту... Это элементарно!",
    "Посмотрел фильм \"Социальная сеть\". Вдохновленно сел писать код.",
    "Среда разработки. Четверг отладки.",
    "Во тьме ночной, при свете дня — ищу ошибку в коде я.",
    "Увидел на часах 10:24. Загадал желание.",
    "Набрал запрос в гугле быстрее, чем он подобрал популярные варианты. Fuck yeah.",
    "Я не страдаю бессонницей. Я ей владею.",
    "Пришел переустанавливать Windows. Принесли зачем-то отвертку.",
    "Работать в главном потоке – это мейнстрим.",
    "Последняя строчка, и иду спать.",
    "Сломал кнопку правого шрифта. Понял значение цитаты: \"Люди начинают ценить только тогда, когда теряют\".",
    "Думай, как баг. Действуй, как баг. И ты найдёшь баг!",
    "Life's too short to remove USB safely.",
    "4 часа думал, как улучшить код. Испортил за 5 минут.",
    "Романтический ужин при свичах в компании соблазнительных цисок.",
    "Пора дефрагментировать квартиру.",
    "Выучил английский, чтобы не менять раскладку.",
    "Если инженер — врач компьютера, то я, безусловно, психолог.",
    "Сел кодить. Сделал билд. Ошибок нет. Странно.",
    "Включил музыку. +10 к правильности кода.",
    "Не работает часть кода? Изменил название переменных, заработало!",
    "Сделал две ошибки — получил нужный результат. Исправил одну — результат неверный.",
    "Занимаюсь сексом — в безопасном режиме.",
    "Увидел в тетради дочери надпись \"Леша+Маша=Дружба\". Не выдержал, исправил на \"Дружба==Леша+Маша\".",
    "В комнате стало холодно. Запустил while(1); в четыре потока.",
    "Успешная компиляция поднимает настроение.",
    "Будь первым. Пиши вирусы для Linux.",
    "О, ты программист? Глянешь компьютер? ... Будто я никогда не видел компьютеров.",
    "Не ложусь спать, пока не закончу. Потому что завтра уже ничего в коде не пойму.",
    "Программист — это комбинация лени и логики.",
    "int i = 5; i = ++i + ++i; Да я точно тебе говорю, 14.",
    "Любимый вид танца: с бубном.",
    "Встал ночью, чтобы сходить в туалет. Просидел за компьютером до утра.",
    "Девушка, как винда. Загрузишь — зависнет.",
    "Завтра дедлайн. Хороший повод начать делать проект.",
    "Любимая каша — Perl'овая.",
    "Накодил? Убери за собой!",
    "Рано или поздно люди взрослеют и переходят на Linux.",
    "В универе ходил только на программирование.",
    "Рассказал другу шутку. Полчаса объяснял термины.",
    "Python — это как Energizer, работает до 10 раз дольше.",
    "Не смог выиграть в логическую игру. Написал программу.",
    "Спросил на форуме, что не так с кодом. Узнал много нового о себе.",
    "Настает ночь. Город начинает кодить.",
    "Написал сотни хороших программ. В голове.",
    "Чтобы отыскать баг, ты должен мыслить как баг.",
    "Сметана — это драйвер для борща.",
    "Терпенье и true все перед root.",
    "У программера есть два состояния: \"втупляю\" и \"поперло\".",
    "Real programmers don't document if it was hard to write, it should be hard to read.",
    "Высыпаюсь, пока включается компьютер.",
    "Как хорошо бы ты ни программировал, всё равно попросят переустановить Windows.",
    "Покажи свой код, и я скажу кто ты.",
    "Написал код — работает. Не нравятся имена переменных — поменял их... Код не работает!",
    "Начинающий программист уверен, что в 1 килобайте 1000 байт. Законченный программист уверен, что в 1 километре 1024 метра.",
    "Как я стал программистом? Мне лень было учиться на другую профессию.",
    "Пока придумывал имя переменной, забыл, для чего она мне нужна.",
    "Решил для себя написать программку для быстрого определения своего IP. Ищу ошибку в тысячной строке.",
    "Код работает с первого раза. Что-то не так...",
    "Сделал в жизни ошибку. Хотел исправить. Error opening file 'life.exe' for writing.",
    "Как-то раз я скомпилировал программу с первого раза без ошибок. Но появилась надпись: \"Тебе всё равно никто не поверит\".",
    "Пришел на свидание к девушке. Подарил букет из оптоволокна.",
    "Паблик морозов. Класс-потомок, выдающий по запросу все данные класса-предка, независимо от степени их сокрытия. ",
    "— Ты чего не спишь? — Закодировался.",
    "Чем больше весит ненужный файл, тем лучше.",
    "На С я могу просто делать ошибки. На С++ я могу их наследовать!",
    "Женская логика — это генератор случайных чисел.",
    "Ушел пораньше с работы, чтобы поработать дома.",
    "Знакомая попросила переустановить windows. Взял дистрибутив ubuntu.",
    "Смотрю сериалы про ЦРУ, чтобы поржать с их \"хакеров\".",
    "Нажимаю \"Выборочная установка\". Далее, далее, далее.",
    "Пришел на работу пораньше — провел все утро вконтакте.",
    "Очередь в магазине. Ну почему ты не стек?!",
    "Искал диск с виндой. Нашел паспорт, зачетку, читательский билет, деньги, еду.",
    "Учил детей читать. Побитово.",
    "5 часов фиксил баг. Исправил одну строчку.",
    "По дороге домой — пишу код в уме.",
    "Жена сказала, что мы мало общаемся. Купил ей компьютер и соединил с моим.",
    "Пишу новую прогу. Пока компилирую старую.",
    "Все работает. Переключил с debug на release. Твою же мать...",
    "На клаве стерлись буквы C и V. Палево.",
    "Windows для чайников. Это не книга — это утверждение.",
    "Температура в комнате, какая бы она ни была — всегда комнатная.",
    "Битва IT-экстрасенсов. Лучшие админы проникают в головы юзеров и угадывают, что они нажали и почему \"ничего не работает\".",
    "Грелся в ванной, нашёл ошибку в коде по памяти.",
    "Пошел в магазин. Купил ящик кофе и печенек.",
    "Написал прогу. Не работает. Все стер, написал заново. Заработало.",
    "3k строчек кода. Баг, ну ты моргни хотя бы.",
    "Да кто такой криворукий код писал?! Ааа, это же я, год назад...",
    "Ничего не делал 10 секунд. Нажал Ctrl-s.",
    "Я бы изменил мир, но Бог не дает исходников.",
    "0 программистов ругал сердитый шеф. Потом уволил одного, и стало их FF.",
    "Я верю только в три вещи: инкапсуляцию, полиморфизм и наследование.",
    "Гонял прогу по тестам. Пытался найти хоть один работающий.",
    "Компилировал, перекомпилировал да не выперекомпилировал.",
    "Дали проект. Глаза делают, руки не хотят.",
    "Сисадмин мнил себя Богом сети. Электрик грубо развеял этот факт.",
    "Тестирование. Время разочарований.",
    "Судя по количеству обновлений Firefox и Flashplayer, их пишет Дарья Донцова.",
    "В високосном байте — девять бит.",
    "Настоящий программист — всегда голодный, потому что он забывает поесть.",
    "Чтобы запомнить телефон, я вычисляю контрольную сумму.",
    "Подруга попросила починить компьютер. Починил.",
    "Хороший программист проливает кофе на себя. И ноут цел, и бодрит в два раза лучше.",
    "Дописал строку. Нажал Ctrl+S.",
    "Закупился валерьянкой — пишу новую программку.",
    "Взломал БД сайта, чтобы вспомнить свой пароль.",
    "Хотел объяснить как это сделать. Сделал сам.",
    "Решил покодить, пока греется суп? Плохая идея!",
    "Код Шредингера — это такой код, не запуская которого, нельзя сказать, есть ли он, или его надо весь удалить и написать новый.",
    "При попытке поработать был обнаружен интернет.",
    "Написал код на бумажке. Отладил в голове.",
    "Все мы расплачиваемся за первородный грех. Изучение Basic в особо впечатлительном возрасте.",
    "Увидел чей-то код. Раскритиковал.",
    "Стакан наполовину пуст или наполовину полон? Я бы сказал, что он в 2 раза больше, чем нужно.",
    "Лег спать в 10 вечера! А вам слабо?",
    "Пустая кружка — единственное, что должно отрывать тебя от кодинга.",
    "У каждого программиста есть инстинкт автосохранения.",
    "Хороший программист должен с легкостью программировать на всем, на чем можно. И с небольшим трудом на том, на чем, казалось бы, нельзя.",
    "Отсутствие фантазии — это Project1 в Новой папке.",
    "В гардеробе выдали номерок 404. Стремно за куртку.",
    "Ночь, улица, фонарь, аптека... Звучит как постепенная загрузка текстур.",
    "Каждый раз, когда ты пишешь long вместо byte, кто-то бежит докупать планки оперативки.",
    "Программист — это не профессия. Программист — это образ жизни.",
    "Если в первый раз не вышло, назови это версией 1.0",
    "На клавиатуре Чака Норриса только клавиши 0 и 1.",
    "Начал писать программу. Объявил 10 переменных. Использовал одну.",
    "Вот черт, я потерялся! В коде.",
    "Рабочий код бесценен. Для всего остального есть MasterCard.",
    "Все мы ходим по лезвию бритвы. Кто-то нюхает кокаин, кто-то убивает людей. Я же, небезопасно извлекаю флешки.",
    "Самый сложный язык программирования — это первый.",
    "— О, ты же шаришь в компах... — Нет, только не это!",
    "Работать надо не 12 часов, а головой.",
    "Не комментируй код. Будь плохим парнем.",
    "Самое трудное в программировании — это придумывать имена переменным.",
    "Не уверен, что стоит заниматься просьбой босса. Лучше исправлю прогу.",
    "Лучшая защита от SQL инъекций — отсутствие базы данных.",
    "Придумал гениальную идею. Загуглил, оказывается, такое уже есть...",
    "Чихнул в перечницу — вызвал рекурсию.",
    "Приснился идеальный код. Проснулся и записал.",
    "На Рython можно написать все. На C++ можно написать Python.",
    "Первый этап разработки программы — борьба с ленью.",
    "Не понравился шрифт на сайте. Взломал. Изменил. Прочитал, что хотел.",
    "Java-программисты после бурного корпоратива не убирают за собой.",
    "Лень кодить нудную фичу. Убедил заказчика, что она не нужна.",
    "Сказал, что занимаюсь версткой. Подарили рубанок!",
    "Шум от кулера, как колыбельная.",
    "Не везёт в любви, повезёт в С++.",
    "Нашел непонятный код в работающей программе. Закомментил.",
    "Коктейль \"Рекурсивный\": 20% спирта, 30% воды, 50% коктейля \"Рекурсивный\".",
    "Когда-нибудь мой сын покажет на иконку сохранения и спросит, почему она так выглядит. Что я ему скажу?",
    "Сколько пальцев на руке? 0, 1, 2, 3, 4... 4!",
    "Как ты смог это реализовать? — Мне приснилось.",
    "Завтра. Как же много в слове этом таится дней и ночей.",
    "Красные глаза \"по умолчанию\".",
    "Поставили на электростанцию Android. Через день — разрядилась.",
    "Программисты по натуре люди ленивые. Поэтому они собираются в стаи и ленятся сообща.",
    "Нет пива? Нет сисадмина!",
    "Сейчас придет девушка в гости. Убрался на рабочем столе.",
    "Переустановил винду за спасибо.",
    "Болтовня ничего не стоит. Покажите мне код.",
    "Есть два вида вредоносных программ. 1) Вирусы. 2) Яндекс-бар.",
    "Я ненавижу всё, что не работает. А то что работает, я пытаюсь улучшить и начинаю ненавидеть.",
    "Ошибка при определенном тесте? Решил проблему if-ом.",
    "Я настолько ленив, что сразу пишу рабочий код.",
    "У программиста было 2 сына: Антон и Неантон.",
    "На вопрос \"Что делаешь?\", шлю скрин диспетчера задач.",
    "Компилятор нашел ошибку. Закомментировал строку.",
    "Закрыл диспетчер задач через диспетчер задач.",
    "Чтобы искать в гугле, жена сперва ищет гугл в яндексе.",
    "Отсортировал массив. Надо написать об этом в своем \"блоге программиста\"."
]
